{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Code/Feb 18 2021-Monthly Global Averages Covid-19.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Feb 2021, 15:28:13

{com}. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Daily COVID-19 Data/Masterfiles/Global COVID-19 Data.dta"

. replace month = 1 if day <= 31
{err}variable {bf}month{sf} not found
{txt}{search r(111), local:r(111);}

{com}.  gen month = 0

. 
. . order month, after(day)

. 
.  replace month = 1 if day <= 31
{txt}(6,065 real changes made)

{com}. (6,101 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 2 if day > 31 & day <= 60
{txt}(6,211 real changes made)

{com}. (6,076 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 3 if day > 60 & day <= 91
{txt}(6,789 real changes made)

{com}. (6,608 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 4 if day > 91 & day <= 121
{txt}(7,133 real changes made)

{com}. (6,569 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 5 if day > 121 & day <= 152
{txt}(7,372 real changes made)

{com}. (6,789 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 6 if day > 152 & day <= 182
{txt}(7,086 real changes made)

{com}. (6,570 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 7 if day > 182 & day <= 213
{txt}(7,288 real changes made)

{com}. (6,789 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 8 if day > 213 & day <= 244
{txt}(7,289 real changes made)

{com}. (6,756 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 9 if day > 244 & day <= 274
{txt}(7,039 real changes made)

{com}. (6,530 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 10 if day > 274 & day <= 305
{txt}(7,103 real changes made)

{com}. (6,773 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 11 if day > 305 & day <= 335
{txt}(6,694 real changes made)

{com}. (6,390 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. . replace month = 12 if day > 335 & day <= 366
{txt}(6,664 real changes made)

{com}. (6,235 real changes made)
{bf}{err}({sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. replace month = 2 if day > 31 & day <= 60
{txt}(0 real changes made)

{com}. gen month2=month(date)
{err}type mismatch
{txt}{search r(109), local:r(109);}

{com}. gen month2 = month(date)
{err}type mismatch
{txt}{search r(109), local:r(109);}

{com}. format date %d
{err}string %fmt required for string variables
{txt}{search r(120), local:r(120);}

{com}. format date %td
{err}string %fmt required for string variables
{txt}{search r(120), local:r(120);}

{com}. destring date, generate(date2)
{txt}date: contains nonnumeric characters; no {res}generate

{com}. order date2, after(date)
{err}variable {bf}date2{sf} not found
{txt}{search r(111), local:r(111);}

{com}. gen date2 = date(date, "20YMD")

. order date2, after(date)

. format date2 %td

. gen month2 = month(date2)

. order month2, after(month)

. sort iso3 date

. replace month2 = 13 if day > 366 & day <= 397
{txt}(6,933 real changes made)

{com}. replace month2 = 14 if day > 397
{txt}(5,187 real changes made)

{com}. save "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data.dta"
{txt}file /Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data.dta saved

{com}. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Outputs/Global Monthly Avg COVID-19.dta"

. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta"

. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Outputs/Global Monthly Avg COVID-19.dta"

. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data.dta"

. order Avg_Temp_2012, after(month2)

. drop Avg_Temp_Uncertainty_2012 Avg_Temp_2012

. collapse (firstnm) iso3 country_un month oecd rcep g20 asean eu Western_Europ

. > e (mean) pop2018-transmission_class, by(iso3 month2)
{bf}{err}>{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. collapse (firstnm) iso3 country_un month oecd rcep g20 asean eu Western_Europe (mean) pop2018-transmission_class, by(iso3 month2)
{err}variable {bf}month2{sf} not found
(error in option {bf:by()})
{txt}{search r(111), local:r(111);}

{com}. clear

. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data.dta"

. drop Avg_Temp_Uncertainty_2012 Avg_Temp_2012

. collapse (firstnm) iso3 country_un month oecd rcep g20 asean eu Western_Europe (mean) pop2018-transmission_class, by(iso3 month)
{err}iso3 may not be both target and by()
{txt}{search r(198), local:r(198);}

{com}. 
. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe (mean) pop2018-transmission_class, by(iso3 month2)
{err}type mismatch
{txt}{search r(109), local:r(109);}

{com}. drop _merge_test

. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe (mean) pop2018-behaveYouGov, by(iso3 month2)
{err}type mismatch
{txt}{search r(109), local:r(109);}

{com}. destring oecd1, replace
{txt}oecd1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(79533 missing values generated)
{res}
{com}. rename oecd1 oecd
{res}{err}variable {bf}oecd{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. drop oecd1

. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe (mean) pop2018-behaveYouGov, by(iso3 month2)
{err}type mismatch
{txt}{search r(109), local:r(109);}

{com}. tostring Lat Long, replace
{txt}Lat was {res:double} now {res:str10}
Long was {res:double} now {res:str10}

{com}. tostring date2-month2, replace
{txt}date2 was {res:float} now {res:str5}
day was {res:float} now {res:str6}
month was {res:float} now {res:str2}
month2 was {res:float} now {res:str2}

{com}. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe (mean) pop2018-behaveYouGov, by(iso3 month2)
{err}type mismatch
{txt}{search r(109), local:r(109);}

{com}. tostring g20 rcep, replace
{txt}g20 was {res:byte} now {res:str1}
rcep was {res:byte} now {res:str1}

{com}. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe (mean) pop2018-behaveYouGov, by(iso3 month2)
{err}type mismatch
{txt}{search r(109), local:r(109);}

{com}. drop tu

. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe iwl_name iwl_office(mean) pop2018-behaveYouGov, by(iso3 month2)
{err}variable {bf}mean{sf} not found
{txt}{search r(111), local:r(111);}

{com}. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe iwl_name iwl_office (mean) pop2018-behaveYouGov, by(iso3 month2)
{err}error:
{col 8}iwl_name = (firstnm) iwl_name
{col 8}iwl_name = (mean) iwl_name
name conflict
{txt}{search r(198), local:r(198);}

{com}. order iwl_name iwl_office, after(Western_Europe)

. collapse (firstnm) country_un month oecd rcep g20 asean eu Western_Europe iwl_name iwl_office (mean) pop2018-behaveYouGov, by(iso3 month2)

. order iso3 month2

. destring month2, replace
{txt}month2: all characters numeric; {res}replaced {txt}as {res}byte

{com}. order iso3 month2

. sort month2

. sort iso3 month2

. rename month2 month_num
{res}
{com}. replace month = "January20" if month_num == 1
{txt}variable {bf}month{sf} was {bf}{res}str2{sf}{txt} now {bf}{res}str9{sf}
{txt}(212 real changes made)

{com}. drop month 

. order month_num, first

. save "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data clean.dta"
{txt}file /Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data clean.dta saved

{com}. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta"

. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data clean.dta"

. gen month_merge = 0

. order month_merge, after(month_num)

. replace month_merge = month_num
{txt}(3,318 real changes made)

{com}. replace month_merge = 1 if month_num == 13
{txt}(233 real changes made)

{com}. replace month_merge = 2 if month_num == 14
{txt}(219 real changes made)

{com}. save "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data clean.dta", replace
{txt}file /Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data clean.dta saved

{com}. merge 1:1 iso3 month_merge using "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta"
{res}{err}variable {bf}month_merge{sf} not found
{txt}{search r(111), local:r(111);}

{com}. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta"

. rename month month_merge
{res}
{com}. save "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta", replace
{txt}file /Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta saved

{com}. use "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Feb 2021/Monthly Global COVID-19 Data clean.dta"

. merge 1:1 iso3 month_merge using "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta"
{res}{err}{p 0 4 2}
variable{err}s{err} iso3
month_merge
do not uniquely identify observations in the
master data
{p_end}
{txt}{search r(459), local:r(459);}

{com}. merge m:1 iso3 month_merge using "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Inputs/Processed Data/Average Monthly Temperature/Avg Monthly Temp by Country 2012 clean.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             755
{txt}{col 9}from master{col 30}{res}             480{txt}  (_merge==1)
{col 9}from using{col 30}{res}             275{txt}  (_merge==2)

{col 5}matched{col 30}{res}           2,838{txt}  (_merge==3)
{col 5}{hline 41}

{com}. sort _merge

. drop if _merge==2
{txt}(275 observations deleted)

{com}. order iso3 month_num

. order iso3 month_num

. order iso3

. sort iso3

. sort iso3 month_num

. order iso3, after(month_merge)

. save "/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Outputs/Feb 18 2021-Monthly Global COVID-19 Data.dta"
{txt}file /Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Outputs/Feb 18 2021-Monthly Global COVID-19 Data.dta saved

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/isminiethridge/Dropbox/JDS_Data/Global Monthly Avg COVID-19/Code/Feb 18 2021-Monthly Global Averages Covid-19.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Feb 2021, 16:59:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}